# coding: utf-8
# 計算する
number = 100
print(number + number) #なお、プログラムではデータを代入した変数同士で計算することも出来る
'''次の様にnumber変数同士を足し算したら答えは200になる
計算はprintをする際に行う事も出来るよ！括弧内に入れればいいよ！
このように計算が出来る「+」の事を総じて「演算子」と呼ぶ
今まで使ってきた「=(イコール)」も演算子で「代入演算子」と呼ばれてるよ！
'''

number = 100 + 20
print(number)

number = 100 * 20
print(number)

number = 100 / 20
print(number)

number = 100 % 30
print(number)

number = 100 * (2 + 3)
print(number)

#基本的な代数演算子
'''
+	足し算	6 + 2	# 8
-	引き算	6 - 2	# 4
*	掛け算	6 * 2	# 12
/	割り算	6 / 2	# 3
%	余り	6 % 4	# 2 '''


#計算の優先順位
'''
高い	( )
｜	* / %
低い	+ - 四則計算の法則だね
'''