'''
演習課題 1
「リストの中身を出力してみよう」
右のコードには、リストが定義されています。
このリストをprint関数を使って出力してください。

プログラムを実行して、正しく出力されれば演習課題クリアです！

期待する出力値
['戦士', '侍', '僧侶', '魔法使い']
'''
teams = [
    '戦士',
    '侍',
    '僧侶',
    '魔法使い'
    ]
print(teams)


'''
演習課題 2
「指定の文字をリストにしてみよう」
item というリストに、下記の要素をこの並び順で代入して、
print関数で出力をしてください

「ロングソード」
「ブレードソード」
「エクスカリバー」

プログラムを実行して、正しく出力されれば演習課題クリアです！

期待する出力値
['ロングソード', 'ブレードソード', 'エクスカリバー']
'''
items = [
    'ロングソード',
    'ブレードソード',
    'エクスカリバー'
    ]
print(items)


'''
演習課題 3
「変数で、リストに代入しよう」
右のコードには、player_1〜3という変数に、文字列が代入されています。
このplayer_1〜3を、この順番でリストに記述して、print関数で出力してください。

プログラムを実行して、正しく出力されれば演習課題クリアです！

期待する出力値
['勇者', '魔法使い', '戦士']
'''
# 変数で、リストに代入する

player_1 = "勇者"
player_2 = "魔法使い"
player_3 = "戦士"

# player_1 ~ 3を、リストに記述して、print関数で出力してください。
teams = [player_1,
    player_2,
    player_3
    ]
print(teams)