'''
演習課題
「リストのゼロ番の要素を取り出してみよう」
右のコードエリアには、5つの要素を持つリストが定義されています。
このリストの1番左の要素をprint関数で出力してください。

プログラムを実行して、正しく出力されれば演習課題クリアです！

期待する出力値
勇者
'''
# リストから特定要素を取り出す

team = ["勇者", "戦士", "侍", "忍者", "魔法使い"]
# teamの1番左の要素をprint関数で出力する
print(team[0])

'''
演習課題「リストから特定要素を取り出してみよう」
右のコードエリアには、5つの要素を持つリストが定義されています。
このリストの左から数えて3個目の要素をprint関数で出力してください。
リストは、ゼロ番から始まることに注意してください。

プログラムを実行して、正しく出力されれば演習課題クリアです！

期待する出力値
侍
'''
# リストから特定要素を取り出す

teams = ["勇者", "戦士", "侍", "忍者", "魔法使い"]
# teamの3番目の要素をprint関数で出力する
print(teams[2])


'''
演習課題「リストの要素数を取得しよう」
右のコードエリアには、weaponリストが定義されています。
このリストの要素数を出力してください。

プログラムを実行して、正しく出力されれば演習課題クリアです！
'''
weapon = ["木の棒", "鉄の棒", "鉄の剣", "銅の剣", "石斧", "エクスカリバー"]
# ここに、要素数を出力するコードを記述する
print(len(weapon))

# 復習って感じでした。