# Your code here!

# 2次元リストで地図を表示する

landmap = [["森" for i in range(20)] for j in range(10)]
landmap[0][0] = "城"
landmap[0][19] = "町"
landmap[9][19] = "町"
for i,line in enumerate(landmap):
    print(str(i) + ":", end="")
    for j,area in enumerate(line):
        if (i % 2 == 0 or j % 3 == 0) and area == "森":
            print("＋", end="")
        else:
            print(area, end="")
    print()

'''出力結果
0:城＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋町
1:＋森森＋森森＋森森＋森森＋森森＋森森＋森
2:＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋
3:＋森森＋森森＋森森＋森森＋森森＋森森＋森
4:＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋
5:＋森森＋森森＋森森＋森森＋森森＋森森＋森
6:＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋
7:＋森森＋森森＋森森＋森森＋森森＋森森＋森
8:＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋＋
9:＋森森＋森森＋森森＋森森＋森森＋森森＋町

僕の想像力の欠如のせいかどう頑張っても＋が道に見えません。
地図にも見えません。
'''